In [1]:
from sqlalchemy import create_engine
import psycopg2
from config import password
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib widget

In [2]:
params = {
    "host"      : "localhost",
    "database"  : "sql-challenge_db",
    "user"      : "postgres",
    "password"  : password,
}

In [3]:
conn = psycopg2.connect(**params)

In [4]:
salaries_df = pd.read_sql("select * from salaries",conn)
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [12]:
salaries_df.plot(kind = 'hist',x='emp_no',y='salary',title='The Most Common Salary Range')
plt.xlabel('Salary')
plt.ylabel('Frequency')
plt.savefig('The Most Common Salary Range.png')

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous â€¦

In [6]:
title_df = pd.read_sql("select * from titles",conn)
title_df

  titles_id               title
0     s0001               Staff
1     s0002        Senior Staff
2     e0001  Assistant Engineer
3     e0002            Engineer
4     e0003     Senior Engineer
5     e0004    Technique Leader
6     m0001             Manager

In [7]:
employees_df = pd.read_sql("select * from employees",conn)
employees_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [8]:
employees_titles_merged_df = pd.merge(employees_df,title_df,how='left',left_on='emp_title_id',right_on='titles_id')

In [9]:
employees_titles_salaries_df = pd.merge(employees_titles_merged_df,salaries_df,how='left',on='emp_no')

In [10]:
salary_by_title = employees_titles_salaries_df.drop(columns='emp_no').groupby('title')

In [13]:
salary_by_title.mean().plot(kind='bar',title='Average Salaries by Titles')
plt.xlabel('Title Name')
plt.xticks(rotation=45)
plt.ylabel('Avg Salary')
plt.tight_layout()
plt.savefig('Average Salaries by Titles.png')

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous â€¦